
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7640303115)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository.artifact-repository
  * google_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.admin&#34;]
  * google_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]
  * google_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]
* Delete
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = (known after apply)
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai.app"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/artifactregistry.admin" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/editor" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be destroyed
  # (because google_project_iam_member.gitops-sa-cloudstorage is not in configuration)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPsFb2l5Q=" -> null
      - id      = "gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/secretmanager.admin" -> null
    }

  # google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/artifactregistry.admin"
    }

  # google_project_iam_member.gitops-sa-roles["roles/editor"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/editor"
    }

  # google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.admin"
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":12,"Program":"tfcmt","SHA1":"9fa18f8e62738d81c09fd5a315f716c7c863a54b","Vars":{},"WorkflowName":"iaac_plan"} -->